Intro to Pandas and Dataframes

In [1]:
import pandas as pd

df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['A','B','C'], index=['x','y','z'])

In [2]:
df.head() #head and tail(), coulmns, tolist(),

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [3]:
df.index.tolist()

['x', 'y', 'z']

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [16]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [5]:
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [7]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [ ]:
coffee.loc[5:8, ['Day', 'Units Sold']] #iloc used indxed so insedt of Day write 0

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45

In [11]:
coffee.iat[0,0]

'Monday'

In [16]:
coffee.sort_values(['Units Sold'], ascending=[1])

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
13     Sunday       Latte          35
11   Saturday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [17]:
for index, rows in coffee.iterrows():
    print(index)

0
1
2
3
4
5
6
7
8
9
10
11
12
13

Filtering Data

In [19]:
bios = pd.read_csv('./data/bios.csv')

In [20]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [28]:
bios.loc[bios['height_cm'] > 215, ['name', 'height_cm']].sort_values('height_cm', ascending=False)

                         name  height_cm
89070                Yao Ming      226.0
5781           Tommy Burleson      223.0
6978          Arvydas Sabonis      223.0
120266           Zhang Zhaoxu      221.0
89075          Roberto Dueñas      221.0
5673           Gunther Behnke      221.0
5089       Viktor Pankrashkin      220.0
6504              Luc Longley      220.0
7188       Vladimir Tkachenko      220.0
118676        Dmitry Musersky      219.0
107408       Peter John Ramos      219.0
130460               Li Muhao      218.0
82100           Frédéric Weis      218.0
139365         Moustapha Fall      218.0
112337          Hamed Haddadi      218.0
6420            Jānis Krūmiņš      218.0
7376      Eurelijus Žukauskas      218.0
5796            Andy Campbell      218.0
5716                 Uwe Blab      218.0
5583     Paulinho Villas Boas      217.0
130461                Zhou Qi      217.0
112312           Stanko Barać      217.0
7281         Stojko Vranković      217.0
52608         Aleksey Kazakov      217.0
7074           Paulo da Silva      217.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6937           David Robinson      216.0
6722         Shaquille O'Neal      216.0
6409         Sergey Kovalenko      216.0
112332    Andreas Glyniadakis      216.0
118663         Timofey Mozgov      216.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
138671          Ondřej Balvín      216.0